Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Организации/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	ТипОрганизации = ЭтотОбъект.ТипОрганизации;
	ИНН = ЭтотОбъект.ИНН;
	
	ИННСтрока = Строка(ИНН);
	Если ТипОрганизации = ПредопределенноеЗначение ("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
		ОжидаемаяДлина = 10;
	ИначеЕсли ТипОрганизации = ПредопределенноеЗначение ("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель") Тогда
		ОжидаемаяДлина = 12;
		
	Иначе
		Возврат;
	КонецЕсли;  
		
	Если СтрДлина(ИННСтрока) <> ОжидаемаяДлина Тогда
		
	ОбщегоНазначения.СообщитьПользователю("Неверное количество цифр в ИНН для типа организации '" + ТипОрганизации + "'. Должно быть " + ОжидаемаяДлина + " цифр.Текущая длина: " + СтрДлина(ИННСтрока));
		
		Отказ = Истина; 
	КонецЕсли;	
	

КонецПроцедуры
